[
    {
      "number": "1 урок",
      "title": "Введение в генеративный искусственный интеллект",
      "description": "Изучите базовые концепции, ознакомьтесь с продвинутыми инструментами и узнайте, как эффективно применять генеративный ИИ в реальных бизнес-условиях.",
      "about": "Генеративные модели искусственного интеллекта меняют подход к ведению бизнеса. Их возможности варьируются от автоматизации генерации и обобщения текста до создания уникальных изображений и дизайна. Эта технология становится всё более неотъемлемой частью стратегий, направленных на повышение эффективности и креативности."
    },
    {
      "number": "2 урок",
      "title": "Введение в LLM",
      "description": "Изучите основы больших языковых моделей (LLM) всего за несколько минут на каждом занятии. Этот курс содержит краткую и целенаправленную информацию, которая поможет вам понять, как работают LLM, как они обучаются и как их применять в реальных ситуациях. Специальных технических знаний не требуется.",
      "about": "Большие языковые модели (LLM), такие как GPT-4 (используется в ChatGPT), Claude и LLaMA, являются мощными инструментами для автоматизации задач, улучшения процесса принятия решений и оптимизации бизнес-процессов. Эти модели используют передовые алгоритмы для обработки и генерации текста, похожего на человеческий, что позволяет применять их в таких областях, как поддержка клиентов, создание контента, анализ данных и автоматизация рабочих процессов."
    },
    {
      "number": "3 урок",
      "title": "Введение в поисковую систему -Расширенная генерация (RAG)",
      "description": "Изучите основы расширенной генерации (RAG), чтобы создавать более умные и надёжные системы искусственного интеллекта. Не нужно программировать, только практические знания из реального мира!",
      "about": "По своей природе большие языковые модели (LLM) полагаются на данные, на которых они когда-то обучались. Но если кто-то захочет обновить эти данные, включив в них актуальную информацию или данные внутренней компании, ему придётся переобучить LLM. Это дорогостоящий и трудоёмкий процесс. Однако так было до появления Retrieval-Augmented Generation (RAG). RAG устраняет необходимость в переобучении и гораздо дешевле в реализации."
    },
    {
      "number": "4 урок",
      "title": "Runway ML",
      "description": "Погрузитесь в мир создания мультимедиа с помощью нашего курса Runway ML, который научит вас работать с изображениями, видео и аудио. Это руководство поможет как новичкам, так и опытным пользователям создавать контент с помощью передовых моделей генеративного ИИ.",
      "about": "В этом курсе, рассчитанном на самостоятельное изучение, вы получите полное представление о Runway ML — мощной платформе, которая упрощает создание медиаконтента с помощью ИИ. Если вы хотите создавать стилизованные изображения, точно редактировать видео или очищать звуковые дорожки, Runway ML предлагает широкий набор инструментов, доступных как новичкам, так и опытным авторам."
    }
  ]