[{
  "_id": {
    "$oid": "6801e96acfc41532a4fc486b"
  },
  "number": "1 урок",
  "title": "Введение в генеративный искусственный интеллект",
  "description": "Изучите базовые концепции, ознакомьтесь с продвинутыми инструментами и узнайте, как эффективно применять генеративный ИИ в реальных бизнес-условиях.",
  "about": "Генеративные модели искусственного интеллекта меняют подход к ведению бизнеса. Их возможности варьируются от автоматизации генерации и обобщения текста до создания уникальных изображений и дизайна. Эта технология становится всё более неотъемлемой частью стратегий, направленных на повышение эффективности и креативности.",
  "theory": "Всем привет, и добро пожаловать на вводный курс по генеративному ИИ. Меня зовут Сандер Шульхофф. Я основатель и генеральный директор Learn Prompting, и я буду вашим инструктором по этому курсу. На протяжении этого курса вы узнаете об определениях, истории и применении генеративного ИИ. Мы рассмотрим генерацию текста с использованием больших языковых моделей, генерацию изображений, реальные генеративные приложения ИИ из различных областей, а также этику ИИ, связанную с предубеждениями, собственностью и конфиденциальностью данных. Давайте начнем.",
  "url": "https://rutube.ru/video/3948a0be10e9f8c9dd657662f3dc6210/"
},
{
  "_id": {
    "$oid": "6801e96acfc41532a4fc486c"
  },
  "number": "2 урок",
  "title": "Введение в LLM",
  "description": "Изучите основы больших языковых моделей (LLM) всего за несколько минут на каждом занятии. Этот курс содержит краткую и целенаправленную информацию, которая поможет вам понять, как работают LLM, как они обучаются и как их применять в реальных ситуациях. Специальных технических знаний не требуется.",
  "about": "Большие языковые модели (LLM), такие как GPT-4 (используется в ChatGPT), Claude и LLaMA, являются мощными инструментами для автоматизации задач, улучшения процесса принятия решений и оптимизации бизнес-процессов. Эти модели используют передовые алгоритмы для обработки и генерации текста, похожего на человеческий, что позволяет применять их в таких областях, как поддержка клиентов, создание контента, анализ данных и автоматизация рабочих процессов.",
  "theory": "Итак, что такое генеративный ИИ и почему он так популярен сейчас? Генеративный ИИ — это тип алгоритма искусственного интеллекта, который ориентирован на создание нового контента. Он изучает закономерности на основе входных данных и использует эти знания для создания выходных данных, аналогичных входным данным. Благодаря относительно недавним прорывам в генеративном ИИ мы смогли генерировать изображения, текст, код, видео и даже музыку. Но прежде чем мы рассмотрим эти последние достижения в области искусственного интеллекта, мы должны сначала оглянуться на ранние формы ИИ, чтобы получить больше интуиции о том, как работает генеративный ИИ. История генеративного ИИ восходит к 1940-м и 50-м годам, с появлением первых нейронных сетей. Нейронная сеть — это тип компьютерной программы, которая учится распознавать закономерности и принимать решения на основе данных. Он работает, копируя то, как человеческий мозг обрабатывает информацию. Точно так же, как в нашем мозге много взаимосвязанных нейронов, которые помогают нам думать и учиться, нейронная сеть имеет множество взаимосвязанных частей, которые помогают ей понимать информацию.",
  "url": "https://rutube.ru/video/f79bc2a5552503b3948efa3e7fbcee9b/"
},
{
  "_id": {
    "$oid": "6801e96acfc41532a4fc486d"
  },
  "number": "3 урок",
  "title": "Расширенная генерация (RAG)",
  "description": "Изучите основы расширенной генерации (RAG), чтобы создавать более умные и надёжные системы искусственного интеллекта. Не нужно программировать, только практические знания из реального мира!",
  "about": "По своей природе большие языковые модели (LLM) полагаются на данные, на которых они когда-то обучались. Но если кто-то захочет обновить эти данные, включив в них актуальную информацию или данные внутренней компании, ему придётся переобучить LLM. Это дорогостоящий и трудоёмкий процесс. Однако так было до появления Retrieval-Augmented Generation (RAG). RAG устраняет необходимость в переобучении и гораздо дешевле в реализации.",
  "theory": "Здравствуйте и добро пожаловать на курс Введение в большие языковые модели. В отличие от многих других наших курсов, этот курс в большей степени посвящен теории. Другими словами, этот курс поможет вам разобраться в технологиях, лежащих в основе таких инструментов, как ChatGPT и Google Gemini, а не предоставит вам методы и практические руководства по использованию моделей генеративного искусственного интеллекта. Это не значит, что этот курс не имеет практического применения в вашем повседневном бизнесе. В конце концов, для успешного использования того или иного инструмента на практике крайне важно, чтобы мы понимали, как этот инструмент работает на самом деле. Очень важно, чтобы мы понимали, как на самом деле работает этот инструмент.",
  "url": "https://rutube.ru/video/1da840b637c0aa89081e1f3917c1b769/"
},
{
  "_id": {
    "$oid": "6801e96acfc41532a4fc486e"
  },
  "number": "4 урок",
  "title": "Runway ML",
  "description": "Погрузитесь в мир создания мультимедиа с помощью нашего курса Runway ML, который научит вас работать с изображениями, видео и аудио. Это руководство поможет как новичкам, так и опытным пользователям создавать контент с помощью передовых моделей генеративного ИИ.",
  "about": "В этом курсе, рассчитанном на самостоятельное изучение, вы получите полное представление о Runway ML — мощной платформе, которая упрощает создание медиаконтента с помощью ИИ. Если вы хотите создавать стилизованные изображения, точно редактировать видео или очищать звуковые дорожки, Runway ML предлагает широкий набор инструментов, доступных как новичкам, так и опытным авторам.",
  "theory": "Мы начнем с определения термина большая языковая модель. Самый простой способ определить большие языковые модели и понять, что они собой представляют, - это просто разобрать термин. Мы начнем с термина 'модель', поскольку именно с ним мы в основном здесь и имеем дело. Большие языковые модели по своей сути являются моделями. Итак, что же такое модель? В мире машинного обучения и искусственного интеллекта модель - это любая математическая конструкция, которая принимает данные в качестве входных данных, обрабатывает их и возвращает полезный результат.Часто результатом является прогнозирование или классификация. Например, модели искусственного интеллекта успешно предсказывают, какой набор антибиотиков лучше всего подходит для лечения резистентной бактериальной инфекции, или помогают нам классифицировать изображения доброкачественных и злокачественных опухолей. Модели могут быть чрезвычайно простыми. Для моделирования продаж с течением времени можно использовать что-то вроде f из x, равного x в квадрате плюс 2. Эта простая функция принимает одно значение, x, и выводит одно значение. Большие языковые модели основаны на моделях, которые принимают тысячи значений и выводят тысячи значений с помощью очень сложных вычислений. Они называются нейронными сетями. Теперь, когда мы знаем, что такое модель, давайте обсудим языковую часть и посмотрим, что такое языковые модели. Проще говоря, языковые модели предсказывают некоторые аспекты языка. Они могут предсказать, является ли предложение разжиганием ненависти, сгенерировать следующее слово в предложении или вывести краткое содержание абзаца. Языковые модели используются для различных целей, но все они, что неудивительно, так или иначе связаны с языком. Теперь, когда мы разобрались с языком и моделью, мы можем поговорить о большей их части. Мы называем их большими языковыми моделями, в отличие от просто языковых моделей, поскольку они содержат миллиарды параметров, в основном миллиарды переменных внутри сложной математической функции, которая формирует часть модели.",
  "url": "https://rutube.ru/video/117e4ffc4bfb623d1f07f2c277a70037/"
}]